app/views/dashboard/editar_cargo_area.html.erb

SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 3 LIMIT 1
---
      <% if current_usuario.area %>
        <%= collection_select(:area, :area_id, @areas, :id, :nome, {:selected => current_usuario.area.id}, {:onChange => 'areaAlterada(this.selectedIndex)'}) %>

SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`id` = 2 LIMIT 1
---
      <% if current_usuario.cargo %>
        <%= collection_select(:cargo, :cargo_id, @cargos, :id, :nome, {:selected => current_usuario.cargo.id}, {:onChange => 'cargoAlterado(this.selectedIndex)'}) %>