app/controllers/areas_controller.rb

	def index
		@areas = Area.all
---
SELECT `areas`.* FROM `areas`

	def show
		@area = Area.find(params[:id])
---
SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 1 LIMIT 1