app/controllers/dashboard_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 140 LIMIT 1
---
  def index
	  @percTotal = current_usuario.resultado_competencias

    usuariosBasicos = NivelUsuario.find(1)[:quant_usuarios]

SELECT `areas`.* FROM `areas`
SELECT `cargos`.* FROM `cargos`
SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 3 LIMIT 1
SELECT `cargos`.* FROM `cargos` WHERE `cargos`.`id` = 2 LIMIT 1
---
  def editar_cargo_area
	  @areas = Area.all
	  @cargos = Cargo.all

    if current_usuario.area.present?
      @area_atual = current_usuario.area.id
    else
      @area_atual = -1
    end

    if current_usuario.cargo.present?

UPDATE `usuarios` SET `area_id` = 2, `pergunta_atual_competencias` = NULL WHERE `usuarios`.`id` = 140
---
  def salvar_cargo_area
    current_usuario.update_cargo_area(params["area"]["area_id"].to_i, params["cargo"]["cargo_id"].to_i)