app/controllers/painel_usuario_controller.rb

	def index
		@areas = Area.all
		@cargos = Cargo.all
---
SELECT `areas`.* FROM `areas`
SELECT `cargos`.* FROM `cargos`