app/controllers/questionario_perfil_controller.rb

SELECT `myers_perguntas`.* FROM `myers_perguntas` WHERE `myers_perguntas`.`id` = 1 LIMIT 1
---
  def prox_pergunta
    atualiza_session_com_perguntas_id
    inicializa_pergunta_atual
    pergunta = MyersPergunta.find(current_usuario.pergunta_atual_perfil)

INSERT INTO `myers_respostas` (`data`, `myers_pergunta_id`, `resposta`, `turno`, `usuario_id`) VALUES (NULL, 2, -2, 3, 140)
UPDATE `usuarios` SET `pergunta_atual_perfil` = 2 WHERE `usuarios`.`id` = 140
---
  def registrar_resposta
    if current_usuario.pergunta_atual_perfil
      if params[:resposta] && [2,1,0,-1,-2].include?(params[:resposta].to_i)
        atualiza_session_com_perguntas_id
        MyersResposta.registrar_resposta current_usuario.id, current_usuario.pergunta_atual_perfil, params[:resposta].to_i, current_usuario.turno_perfil
        posicao_atual = usuario_session["lista_perfil"].index(current_usuario.pergunta_atual_perfil)
        unless posicao_atual == 0
          current_usuario.pergunta_atual_perfil = usuario_session["lista_perfil"][posicao_atual - 1]
          current_usuario.save