app/controllers/questionario_competencias_controller.rb

  def prox_pergunta
    atualiza_session_com_competencias
    inicializa_pergunta_atual
    if current_usuario.pergunta_atual_competencias
      competencia = Competencia.find(current_usuario.pergunta_atual_competencias)
      @pergunta = competencia[:nome]
      @nivel_1 = competencia[:nivel_1]
      @nivel_2 = competencia[:nivel_2]
      @nivel_3 = competencia[:nivel_3]
      @nivel_4 = competencia[:nivel_4]
      @nivel_5 = competencia[:nivel_5]
      @total = usuario_session["lista_competencias"].length
---
SELECT `competencias`.* FROM `competencias` WHERE `competencias`.`id` = 1 LIMIT 1
SELECT `competencias`.* FROM `competencias`

  def registrar_resposta
    if current_usuario.pergunta_atual_competencias
      if [1,2,3,4,5].include?(params[:nivel].to_i)
        atualiza_session_com_competencias
        CompUsuario.registrar_resposta current_usuario.id, current_usuario.pergunta_atual_competencias, params[:nivel], current_usuario.turno_competencias
        posicao_atual = usuario_session["lista_competencias"].index(current_usuario.pergunta_atual_competencias)
        unless posicao_atual == 0
          current_usuario.pergunta_atual_competencias = usuario_session["lista_competencias"][posicao_atual - 1]
          current_usuario.save
---
INSERT INTO `comp_usuarios` (`competencia_id`, `data`, `nivel`, `turno`, `usuario_id`) VALUES (1, NULL, 3, 1, 140)
UPDATE `usuarios` SET `pergunta_atual_competencias` = 2 WHERE `usuarios`.`id` = 140